fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПостроитьДиаграммуОтпусков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграммуОтпусков()
	
	Диаграмма.Очистить();
	Диаграмма.Обновление = Ложь;
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	
	СерияОтпусков = Диаграмма.УстановитьСерию("Отпуска");
	СерияОтпусков.Текст = "Отпуска сотрудников";
	
	НачалоПериода = НачалоГода(?(ЗначениеЗаполнено(Объект.Год), Дата(Объект.Год, 1, 1), ТекущаяДатаСеанса()));
	КонецПериода = КонецГода(НачалоПериода);
	
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		
		Если СтрокаОтпуска.ДатаНачала = '00010101' Или СтрокаОтпуска.ДатаОкончания = '00010101' Тогда
			Продолжить;
		КонецЕсли;
		
		Точка = Диаграмма.УстановитьТочку(СтрокаОтпуска.Сотрудник);
		Точка.Текст = Строка(СтрокаОтпуска.Сотрудник);
		Точка.Расшифровка = СтрокаОтпуска.Сотрудник;
		
		Значение = Диаграмма.ПолучитьЗначение(Точка, СерияОтпусков);
		Значение.Расшифровка = СтрокаОтпуска.Сотрудник;
		
		Интервал = Значение.Добавить();
		Интервал.Начало = СтрокаОтпуска.ДатаНачала;
		Интервал.Конец = СтрокаОтпуска.ДатаОкончания;
		Интервал.Расшифровка = СтрокаОтпуска.Сотрудник;
		
		КоличествоКалендарныхДней = СтрокаОтпуска.ДатаОкончания - СтрокаОтпуска.ДатаНачала + 1;
		Интервал.Текст = СтрШаблон("%1 дн.", КоличествоКалендарныхДней);
		
		// Отпуск длиннее 28 календарных дней выделяется цветом.
		Если КоличествоКалендарныхДней > 28 Тогда
			Интервал.Цвет = ЦветаСтиля.ЦветАкцента;
		КонецЕсли;
		
	КонецЦикла;
	
	Диаграмма.УстановитьПолныйИнтервал(НачалоПериода, КонецПериода);
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
